brew "chezmoi"
brew "fish"
brew "direnv"
brew "zoxide"
brew "gh"
brew "git"
brew "diff-so-fancy"
brew "koekeishiya/formulae/skhd"

brew "jq"
brew "neovim"
brew "fzf"
brew "yt-dlp"
brew "pvinis/pvinis/colortools"
brew "mas"

# brew "fortune"
# brew "git-crypt"
# brew "gnupg"
# brew "gnuplot"
# brew "scrcpy"
# brew "shfmt"
# brew "solana"
# brew "tmux"
# brew "tree"

cask "font-iosevka"

cask "syncthing"
cask "tailscale"
cask "1password"
cask "1password-cli"
cask "betterdisplay"
cask "cursor"
cask "arc"
cask "dropshare"
cask "fantastical"
cask "jordanbaird-ice"
cask "raycast"
cask "maccy"
cask "iterm2"
cask "leader-key"
cask "steermouse"
cask "timemator"

cask "zen-browser"
cask "webcatalog"
cask "google-chrome"

cask "beeper"
cask "discord"
cask "viber"
cask "skype"
cask "slack"
cask "zoom"
cask "telegram-desktop"

cask "xcodes"
cask "appcleaner"
cask "chatgpt"
cask "daisydisk"
cask "gimp"
cask "spotify"
cask "obs"
cask "latest"
cask "parsec"
cask "rectangle-pro"
cask "save-hollywood"
cask "sonos"
cask "stremio"

cask "fork"
cask "ghostty"
cask "notion"
cask "docker"
cask "figma"
cask "around"
cask "dbeaver-community"
cask "another-redis-desktop-manager"

cask "stremio"

# cask "kopiaui"
# cask "linear-linear"
# cask "netnewswire"
# cask "ollama"
# cask "ollamac"
# cask "pictogram"
# cask "popclip"
# cask "session"
# cask "shottr"
# cask "siyuan"
# cask "stats"
# cask "steam"
# cask "transnomino"

mas "TestFlight", id: 899247664
mas "Things", id: 904280696
mas "TV Time: Track Shows & Movies", id: 431065232
mas "Day Progress", id: 6450280202
mas "TP-Link Tapo", id: 1472718009
mas "TP-Link Deco", id: 1186159417
