tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "pvinis/pvinis"
tap "timescale/tap"

brew "chezmoi"
brew "cocoapods"
brew "direnv"
brew "fish"
brew "fortune"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "gnupg"
brew "gnuplot"
brew "jq"
brew "neovim"
brew "node"
brew "scrcpy"
brew "shfmt"
brew "solana"
brew "tmux"
brew "tree"
brew "yt-dlp"
brew "zoxide"
brew "koekeishiya/formulae/skhd"
brew "pvinis/pvinis/colortools"
brew "timescale/tap/timescaledb"

cask "font-iosevka"

cask "syncthing"
cask "tailscale"
cask "1password"
cask "1password-cli"
cask "betterdisplay"
cask "cursor"
cask "arc"
cask "dropshare"
cask "fantastical"
cask "ghostty"
cask "jordanbaird-ice"
cask "raycast"
cask "leader-key"
cask "timemator"

cask "zen-browser"
cask "webcatalog"
cask "google-chrome"

cask "beeper"
cask "discord"
cask "viber"
cask "skype"
cask "slack"
cask "zoom"

cask "xcodes"
cask "appcleaner"
cask "chatgpt"
cask "daisydisk"
cask "gimp"
cask "latest"

cask "fork"
cask "iterm2"
cask "notion"
cask "docker"
cask "figma"
cask "around"
cask "dbeaver-community"
cask "another-redis-desktop-manager"

# cask "kopiaui"
# cask "linear-linear"
# cask "maccy"
# cask "netnewswire"
# cask "obs"
# cask "ollama"
# cask "ollamac"
# cask "parsec"
# cask "pictogram"
# cask "popclip"
# cask "rectangle-pro"
# cask "save-hollywood"
# cask "session"
# cask "shottr"
# cask "siyuan"
# cask "sonos"
# cask "spotify"
# cask "stats"
# cask "steam"
# cask "stremio"
# cask "transnomino"
