# taps
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "pvinis/pvinis"

brew "mas"

# base
brew "git"
brew "asdf"

# shell
brew "zsh"
brew "thefuck"
brew "trash"

# brew "ag"
#brew "fzf"

# ruby
brew "chruby"
brew "ruby-install"

# brew "yarn", args: ["without-node"]
brew "nodenv"
brew "colortools"

cask "keepingyouawake"

# messaging
cask "franz"
#cask "rambox"

# dev

mas "xcode", id: 497799835


cask "visual-studio-code"
#cask "react-native-debugger"
#cask "docker"

## react native
cask "react-native-debugger"
cask "reactotron"
brew "watchman"

cask "webtorrent"
#cask "teamviewer"
cask "save-hollywood"
#cask "postman"

cask "the-unarchiver"


#cask "arq"
cask "skype"
cask "spotify"
cask "steam"
cask "vlc"
#cask "tunnelblick"
cask "dropbox-beta"
#cask "firefox-beta"
#cask "google-chrome-beta"
cask "1password-beta"
cask "airmail-beta"
#cask "iterm2-nightly"
#cask "vnc-viewer"

# fonts
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-fontawesome"
cask "font-ibm-plex"
cask "font-input"
cask "font-roboto"
cask "font-source-sans-pro"

# mas
mas "paste", id: 967805235
mas "magnet", id: 441258766




tap "devhubapp/devhub"
tap "getsentry/tools"
tap "jakehilborn/jakehilborn"
tap "koekeishiya/formulae"
tap "nodenv/nodenv"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "pvinis/pvinis"
tap "px4/px4"
tap "railwaycat/emacsmacport"
tap "wix/brew"
brew "gdbm"
brew "readline"
brew "asciinema"
brew "automake"
brew "coreutils"
brew "libyaml"
brew "aspell"
brew "avrdude"
brew "bison"
brew "boost"
brew "boost-python"
brew "brew-gem"
brew "bugsnag-dsym-upload"
brew "libffi"
brew "python"
brew "chruby"
brew "chunkwm"
brew "clang-format"
brew "cliclick"
brew "cmake"
brew "curl"
brew "dfu-programmer"
brew "dfu-util"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gem-doing"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "graphviz"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "ios-deploy"
brew "ipfs"
brew "jq"
brew "kakoune"
brew "librsvg"
brew "libssh2"
brew "mosh"
brew "neovim"
brew "nodenv"
brew "paperkey"
brew "proselint"
brew "qrencode"
brew "sdl2"
brew "shellcheck"
brew "swig"
brew "the_silver_searcher"
brew "wget"
brew "xcodegen"
brew "yarn"
brew "zbar"
brew "getsentry/tools/sentry-cli"
#brew "koekeishiya/formulae/skhd"
#brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "nodenv/nodenv/node-build-update-defs"
brew "pvinis/pvinis/colortools"
brew "pvinis/pvinis/flick"
brew "px4/px4/gcc-arm-none-eabi"
brew "wix/brew/applesimutils"
cask "1password-beta"
cask "airmail-beta"
cask "android-platform-tools"
cask "android-sdk"
cask "android-studio"
cask "appcleaner"
cask "bitbar"
cask "daisydisk"
cask "devhub"
cask "discord"
cask "diskmaker-x"
cask "docker"
cask "dozer"
cask "dropbox-beta"
cask "emacs-mac"
cask "firefox-beta"
cask "firefox-developer-edition"
cask "firefox-nightly"
cask "flipper"
cask "flux"
cask "fork"
cask "franz"
cask "gimp"
cask "google-chrome-beta"
cask "gpg-suite"
cask "hammerspoon"
cask "iterm2-beta"
cask "itsycal"
cask "java8"
cask "keepingyouawake"
cask "keybase"
cask "licecap"
cask "lmms"
cask "mactracker"
cask "netnewswire"
cask "pennywise"
cask "phoenix"
cask "postman"
cask "save-hollywood"
cask "skype"
cask "slack-beta"
cask "spotify"
cask "steam"
cask "textmate"
cask "the-unarchiver"
cask "thunderbird"
cask "trailer"
cask "vagrant"
cask "veonim"
cask "vimr"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "vlc"
cask "webtorrent"
mas "Canopy", id: 1419224245
mas "Gifski", id: 1351639930
mas "GIPHY CAPTURE", id: 668208984
mas "Gladys", id: 1382386877
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paste", id: 967805235
mas "Pym", id: 1451733095
mas "Wire", id: 931134707
mas "Xcode", id: 497799835
